# **Assignment 1-Part 1**

Note: It should take you an estimated time of 45 minutes to complete this part.

**Importing relevant libraries**

In [ ]:
import pandas as pd

# **Instructions**

How to run this on Google Colab: Uncomment the code cells below and place your csv files on Drive to run this assignment on Google Colab (only if you want to - jupyter notebooks work just fine)

In [ ]:
'''
Linking google colab to your drive folder
'''
# from google.colab import drive
# drive.mount('/content/gdrive', force_remount=True)

'\nLinking google colab to your drive folder\n'

In [ ]:
'''
Place the csv files inside your drive and then run this cell
'''
# %cd /content/gdrive/My\ Drive/

'\nPlace the csv files inside your drive and then run this cell\n'

# **Submission Instructions**

* You should name the notebook as **YourRollNumber_PartNumber.ipynb**. (e.g. this part should be named as *`2XXXXXXX_1.ipynb`*)
* You must submit a zip file containg just the notebook and it must not have any folder or any other file. 
* The name of the zip file must be your `Roll Number`

This is an introductory assignment based on Pandas which will provide a hands-on experience of using different functions and manipulating the dataset accordingly.

**Question 1:** Read the dataset from `top_50_restaurants.csv` and assign this dataframe to a variable.

In [2]:
import pandas as pd
df=pd.read_csv("top_50_restaurants.csv")

   Year  Ranking                   Name      City   Country  Latitude  \
0  2018        1    Osteria Francescana    Modena     Italy   44.6431
1  2018        2  El Celler de Can Roca    Girona     Spain   41.9808
2  2018        3                Mirazur    Menton    France   43.7747
3  2018        4    Eleven Madison Park  New York       USA   40.7146
4  2018        5                 Gaggan   Bangkok  Thailand   13.7500
5  2018        6                Central      Lima      Peru  -12.0430

   Longitude
0    10.9341
1     2.8187
2     7.5046
3   -74.0071
4   100.5160
5   -77.0280

**Question 2: Part A** Using this variable, print out the first five rows of the dataset.

In [138]:
(df.head())

,Year,Ranking,Name,City,Country,Latitude,Longitude
0,2018,1,Osteria Francescana,Modena,Italy,44.6431,10.9341
1,2018,2,El Celler de Can Roca,Girona,Spain,41.9808,2.8187
2,2018,3,Mirazur,Menton,France,43.7747,7.5046
3,2018,4,Eleven Madison Park,New York,USA,40.7146,-74.0071
4,2018,5,Gaggan,Bangkok,Thailand,13.7500,100.5160

**Question 2: Part B** Using this variable, print out the last five rows of the dataset.

In [137]:
(df.tail())

,Year,Ranking,Name,City,Country,Latitude,Longitude
45,2018,46,Saison,San Francisco,USA,37.777100,-122.419600
46,2018,47,Schloss Schauenstein,Fürstenau,Switzerland,46.716667,9.433333
47,2018,48,Hiša Franko,Kobarid,Slovenia,46.246436,13.578006
48,2018,49,Nahm,Bangkok,Thailand,13.750000,100.516000
49,2018,50,The Test Kitchen,Cape Town,South Africa,-33.916000,18.416000

**Question 3 Part A:** Which country is the most popular in the list of top 50 restaurants?

In [22]:
df.loc[df["Ranking"]==1,"Country"]

0    Italy
Name: Country, dtype: object

**Question 3 Part B:** Which city is the most popular in the list of top 50 restaurants?

In [136]:


df.loc[df["Ranking"]==1, "City"]

0    Modena
Name: City, dtype: object

**Question 4:** Print the dataframe with restaurants ranking between 35-40 (exclusive of 35 and 40).

In [127]:
df.loc[((df["Ranking"]> 35) & (df["Ranking"] < 40))]

,Year,Ranking,Name,City,Country,Latitude,Longitude
35,2018,36,Reale,Castel di Sangro,Italy,41.783333,14.1000
36,2018,37,Restaurant Tim Raue,Berlin,Germany,52.516100,13.3770
37,2018,38,Lyle's,London,UK,51.506400,-0.1272
38,2018,39,Astrid y Gastón,Lima,Peru,-12.043000,-77.0280

**Question 5:** Print the dataframe with restaurants ranking 20-30 (inclusive of 20 and 30) in UK, USA and Spain.

In [45]:
import pandas as pd
df=pd.read_csv("top_50_restaurants.csv")
df.loc[((df['Country'] == 'UK') |(df['Country'] == 'USA')| (df['Country'] == 'Spain')) & ((df['Ranking'] >= 20) & (df['Ranking']<=30)),   'Year':]

    Year  Ranking          Name      City Country  Latitude  Longitude
24  2018       25         Cosme  New York     USA   40.7146   -74.0071
25  2018       26  Le Bernardin  New York     USA   40.7146   -74.0071

**Question 6 Part A:** Does Peru have more restaurants on the list compared to Japan? Code to demonstrate this in the following cell.

In [124]:
from IPython.display import display
peru=df[df["Country"]=='Peru']
japan=df[df["Country"]=='Japan']
display(japan)
display(peru)

    Year  Ranking               Name   City Country  Latitude  Longitude
16  2018       17                Den  Tokyo   Japan   35.6249   139.5856
21  2018       22           Narisawa  Tokyo   Japan   35.6249   139.5856
40  2018       41  Nihonryori RyuGin  Tokyo   Japan   35.6249   139.5856

    Year  Ranking             Name  City Country  Latitude  Longitude
5   2018        6          Central  Lima    Peru   -12.043    -77.028
6   2018        7            Maido  Lima    Peru   -12.043    -77.028
38  2018       39  Astrid y Gastón  Lima    Peru   -12.043    -77.028

**Question 6 Part B:** Give your answer as 'Yes' or 'No' according to Part A

In [89]:
final_answer = No

**Well done! :) Pat yourself on the back for completing the first part**

In [125]:
print("Pat")

Pat